RTEMS/rtems/c/src/lib/libbsp/arm/lpc24xx/network/network.c
/**
 * @file
 *
 * @ingroup lpc24xx
 *
 * @brief Network driver.
 */

/*
 * Copyright (c) 2008
 * Embedded Brains GmbH
 * Obere Lagerstr. 30
 * D-82178 Puchheim
 * Germany
 * rtems@embedded-brains.de
 *
 * The license and distribution terms for this file may be found in the file
 * LICENSE in this distribution or at http://www.rtems.com/license/LICENSE.
 */

#include <errno.h>
#include <inttypes.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>

#include <rtems.h>
#include <rtems/rtems_bsdnet.h>
#include <rtems/rtems_mii_ioctl.h>

#include <sys/param.h>
#include <sys/socket.h>
#include <sys/sockio.h>
#include <sys/mbuf.h>

#include <net/if.h>
#include <net/if_arp.h>
#include <netinet/in.h>
#include <netinet/if_ether.h>
#include <netinet/in_systm.h>
#include <netinet/ip.h>

#include <bsp.h>
#include <bsp/lpc24xx.h>
#include <bsp/irq.h>
#include <bsp/io.h>
#include <bsp/utility.h>

#include <rtems/status-checks.h>

#if MCLBYTES > (2 * 1024)
  #error "MCLBYTES to large"
#endif

#define LPC24XX_ETH_INTERFACE_NUMBER 1

/**
 * @brief Start address of the Ethernet RAM.
 */
#define LPC24XX_ETH_RAM_START 0x7fe00000U

/**
 * @brief Size of the Ethernet RAM.
 */
#define LPC24XX_ETH_RAM_SIZE (16 * 1024)

#define LPC24XX_ETH_RAM_END \
  (LPC24XX_ETH_RAM_START + LPC24XX_ETH_RAM_SIZE)

#define LPC24XX_ETH_TRANSMIT_BUFFER_SIZE 1518

#define LPC24XX_ETH_RECEIVE_UNIT_SIZE \
  (ETH_TRANSFER_DESCRIPTOR_SIZE \
    + ETH_RECEIVE_INFO_SIZE \
    + 4)

#define LPC24XX_ETH_TRANSMIT_UNIT_SIZE \
  (ETH_TRANSFER_DESCRIPTOR_SIZE \
    + ETH_TRANSMIT_STATUS_SIZE \
    + LPC24XX_ETH_TRANSMIT_BUFFER_SIZE)

#define LPC24XX_ETH_RECEIVE_UNIT_NUMBER 54

#define LPC24XX_ETH_TRANSMIT_UNIT_NUMBER 10

#define LPC24XX_ETH_RECEIVE_DATA_SIZE \
  (LPC24XX_ETH_RECEIVE_UNIT_NUMBER \
    * LPC24XX_ETH_RECEIVE_UNIT_SIZE)

#define LPC24XX_ETH_RECEIVE_DATA_START \
  LPC24XX_ETH_RAM_START

#define LPC24XX_ETH_RECEIVE_DATA_END \
  (LPC24XX_ETH_RECEIVE_DATA_START \
    + LPC24XX_ETH_RECEIVE_DATA_SIZE)

#define LPC24XX_ETH_TRANSMIT_DATA_SIZE \
  (LPC24XX_ETH_TRANSMIT_UNIT_NUMBER \
    * LPC24XX_ETH_TRANSMIT_UNIT_SIZE)

#if 1

#define LPC24XX_ETH_TRANSMIT_DATA_START \
  LPC24XX_ETH_RECEIVE_DATA_END

#else

static char lpc24xx_eth_transmit_buffer [LPC24XX_ETH_TRANSMIT_DATA_SIZE];

#define LPC24XX_ETH_TRANSMIT_DATA_START \
  lpc24xx_eth_transmit_buffer

#endif

#define LPC24XX_ETH_TRANSMIT_DATA_END \
  (LPC24XX_ETH_TRANSMIT_DATA_START \
    + LPC24XX_ETH_TRANSMIT_DATA_SIZE)

#if LPC24XX_ETH_TRANSMIT_DATA_END > LPC24XX_ETH_RAM_END && 0
  #error "Ethernet RAM overflow"
#endif

#define LPC24XX_ETH_RECEIVE_DESC_START \
  LPC24XX_ETH_RECEIVE_DATA_START

#define LPC24XX_ETH_RECEIVE_INFO_START \
  (LPC24XX_ETH_RECEIVE_DESC_START \
    + LPC24XX_ETH_RECEIVE_UNIT_NUMBER * ETH_TRANSFER_DESCRIPTOR_SIZE)

#define LPC24XX_ETH_RECEIVE_MBUF_START \
  (LPC24XX_ETH_RECEIVE_INFO_START \
    + LPC24XX_ETH_RECEIVE_UNIT_NUMBER * ETH_RECEIVE_INFO_SIZE)

#define LPC24XX_ETH_TRANSMIT_DESC_START \
  LPC24XX_ETH_TRANSMIT_DATA_START

#define LPC24XX_ETH_TRANSMIT_STATUS_START \
  (LPC24XX_ETH_TRANSMIT_DATA_START \
    + LPC24XX_ETH_TRANSMIT_UNIT_NUMBER * ETH_TRANSFER_DESCRIPTOR_SIZE)

#define LPC24XX_ETH_TRANSMIT_BUFFER_START \
  (LPC24XX_ETH_TRANSMIT_STATUS_START \
    + LPC24XX_ETH_TRANSMIT_UNIT_NUMBER * ETH_TRANSMIT_STATUS_SIZE)

#define LPC24XX_ETH_EVENT_INITIALIZE RTEMS_EVENT_1

#define LPC24XX_ETH_EVENT_START RTEMS_EVENT_2

#define LPC24XX_ETH_EVENT_INTERRUPT RTEMS_EVENT_3

#define LPC24XX_ETH_INTERRUPT_RECEIVE \
  (ETH_INT_RX_ERROR | ETH_INT_RX_FINISHED | ETH_INT_RX_DONE)

#define LPC24XX_ETH_INTERRUPT_TRANSMIT \
  (ETH_INT_TX_DONE | ETH_INT_TX_FINISHED | ETH_INT_TX_ERROR)

#define LPC24XX_ETH_RX_STAT_ERRORS \
  (ETH_RX_STAT_CRC_ERROR \
    | ETH_RX_STAT_SYMBOL_ERROR \
    | ETH_RX_STAT_LENGTH_ERROR \
    | ETH_RX_STAT_ALIGNMENT_ERROR \
    | ETH_RX_STAT_OVERRUN \
    | ETH_RX_STAT_NO_DESCRIPTOR)

#define LPC24XX_ETH_LAST_FRAGMENT_FLAGS \
  (ETH_TX_CTRL_OVERRIDE \
    | ETH_TX_CTRL_PAD \
    | ETH_TX_CTRL_CRC \
    | ETH_TX_CTRL_INTERRUPT \
    | ETH_TX_CTRL_LAST)

#ifdef DEBUG
  #define LPC24XX_ETH_PRINTF(...) printf(__VA_ARGS__)
  #define LPC24XX_ETH_PRINTK(...) printk(__VA_ARGS__)
#else
  #define LPC24XX_ETH_PRINTF(...)
  #define LPC24XX_ETH_PRINTK(...)
#endif

typedef enum {
  LPC24XX_ETH_NOT_INITIALIZED,
  LPC24XX_ETH_INITIALIZED,
  LPC24XX_ETH_STARTED,
  LPC24XX_ETH_RUNNING
} lpc24xx_eth_state;

typedef struct {
  struct arpcom arpcom;
  struct rtems_mdio_info mdio_info;
  lpc24xx_eth_state state;
  rtems_id receive_task;
  rtems_id transmit_task;
  unsigned receive_unit_number;
  unsigned transmit_unit_number;
  unsigned received_frames;
  unsigned receive_interrupts;
  unsigned transmitted_frames;
  unsigned transmit_interrupts;
  unsigned receive_overrun_errors;
  unsigned receive_fragment_errors;
  unsigned receive_crc_errors;
  unsigned receive_symbol_errors;
  unsigned receive_length_errors;
  unsigned receive_alignment_errors;
  unsigned receive_no_descriptor_errors;
  unsigned receive_fatal_errors;
  unsigned transmit_underrun_errors;
  unsigned transmit_late_collision_errors;
  unsigned transmit_excessive_collision_errors;
  unsigned transmit_excessive_defer_errors;
  unsigned transmit_no_descriptor_errors;
  unsigned transmit_overflow_errors;
  unsigned transmit_fatal_errors;
} lpc24xx_eth_driver_entry;

static lpc24xx_eth_driver_entry lpc24xx_eth_driver_data = {
  .state = LPC24XX_ETH_NOT_INITIALIZED,
  .receive_task = RTEMS_ID_NONE,
  .transmit_task = RTEMS_ID_NONE
};

static inline uint32_t lpc24xx_eth_increment(
  uint32_t value,
  uint32_t cycle
)
{
  if (value < cycle) {
    return ++value;
  } else {
    return 0;
  }
}

static void lpc24xx_eth_reset_filter(void)
{
  MAC_RXFILTERCTRL = 0;
  MAC_RXFILTERWOLCLR = 0xcf;
  MAC_HASHFILTERL = 0;
  MAC_HASHFILTERH = 0;
}

static void lpc24xx_eth_enable_promiscous_mode(bool enable)
{
  if (enable) {
    MAC_RXFILTERCTRL = ETH_RX_FIL_CTRL_ACCEPT_PERFECT
      | ETH_RX_FIL_CTRL_ACCEPT_UNICAST
      | ETH_RX_FIL_CTRL_ACCEPT_MULTICAST
      | ETH_RX_FIL_CTRL_ACCEPT_BROADCAST;
  } else {
    MAC_RXFILTERCTRL = ETH_RX_FIL_CTRL_ACCEPT_PERFECT
      | ETH_RX_FIL_CTRL_ACCEPT_BROADCAST;
  }
}

