RTEMS/rtems/c/src/lib/libbsp/arm/lpc24xx/network/network.c
static void lpc24xx_eth_interrupt_handler(void *arg)
{
  lpc24xx_eth_driver_entry *e = (lpc24xx_eth_driver_entry *) arg;
  rtems_event_set re = 0;
  rtems_event_set te = 0;
  uint32_t ie = 0;

  /* Get interrupt status */
  uint32_t im = MAC_INTENABLE;
  uint32_t is = MAC_INTSTATUS & im;

  /* Check receive interrupts */
  if (IS_FLAG_SET(is, ETH_INT_RX_OVERRUN)) {
    re = LPC24XX_ETH_EVENT_INITIALIZE;
    ++e->receive_fatal_errors;
  } else if (IS_ANY_FLAG_SET(is, LPC24XX_ETH_INTERRUPT_RECEIVE)) {
    re = LPC24XX_ETH_EVENT_INTERRUPT;
    ie = SET_FLAGS(ie, LPC24XX_ETH_INTERRUPT_RECEIVE);
  }

  /* Send events to receive task */
  if (re != 0) {
    ++e->receive_interrupts;
    (void) rtems_event_send(e->receive_task, re);
  }

  /* Check transmit interrupts */
  if (IS_FLAG_SET(is, ETH_INT_TX_UNDERRUN)) {
    te = LPC24XX_ETH_EVENT_INITIALIZE;
    ++e->transmit_fatal_errors;
  } else if (IS_ANY_FLAG_SET(is, LPC24XX_ETH_INTERRUPT_TRANSMIT)) {
    te = LPC24XX_ETH_EVENT_INTERRUPT;
    ie = SET_FLAGS(ie, LPC24XX_ETH_INTERRUPT_TRANSMIT);
  }

  /* Send events to transmit task */
  if (te != 0) {
    ++e->transmit_interrupts;
    (void) rtems_event_send(e->transmit_task, te);
  }

  LPC24XX_ETH_PRINTK("interrupt: rx = 0x%08x, tx = 0x%08x\n", re, te);

  /* Update interrupt mask */
  MAC_INTENABLE = CLEAR_FLAGS(im, ie);

  /* Clear interrupts */
  MAC_INTCLEAR = is;
}

static void lpc24xx_eth_enable_receive_interrupts(void)
{
  rtems_interrupt_level level;

  rtems_interrupt_disable(level);
  MAC_INTENABLE = SET_FLAGS(MAC_INTENABLE, LPC24XX_ETH_INTERRUPT_RECEIVE);
  rtems_interrupt_enable(level);
}

static void lpc24xx_eth_disable_receive_interrupts(void)
{
  rtems_interrupt_level level;

  rtems_interrupt_disable(level);
  MAC_INTENABLE = CLEAR_FLAGS(MAC_INTENABLE, LPC24XX_ETH_INTERRUPT_RECEIVE);
  rtems_interrupt_enable(level);
}

static void lpc24xx_eth_enable_transmit_interrupts(void)
{
  rtems_interrupt_level level;

  rtems_interrupt_disable(level);
  MAC_INTENABLE = SET_FLAGS(MAC_INTENABLE, LPC24XX_ETH_INTERRUPT_TRANSMIT);
  rtems_interrupt_enable(level);
}

static void lpc24xx_eth_disable_transmit_interrupts(void)
{
  rtems_interrupt_level level;

  rtems_interrupt_disable(level);
  MAC_INTENABLE = CLEAR_FLAGS(MAC_INTENABLE, LPC24XX_ETH_INTERRUPT_TRANSMIT);
  rtems_interrupt_enable(level);
}

static struct mbuf *lpc24xx_eth_new_mbuf(struct ifnet *ifp, bool wait)
{
  struct mbuf *m = NULL;
  int mw = wait ? M_WAIT : M_DONTWAIT;

  MGETHDR(m, mw, MT_DATA);
  if (m != NULL) {
    MCLGET(m, mw);
    if (IS_FLAG_SET(m->m_flags, M_EXT)) {
      /* Set receive interface */
      m->m_pkthdr.rcvif = ifp;

      /* Adjust by two bytes for proper IP header alignment */
      m->m_data = mtod(m, char *) + 2;

      return m;
    } else {
      m_free(m);
    }
  }

  return NULL;
}

static bool lpc24xx_eth_add_new_mbuf(
  struct ifnet *ifp,
  volatile lpc24xx_eth_transfer_descriptor *desc,
  struct mbuf **mbuf_table,
  uint32_t i,
  bool wait
)
{
  /* New mbuf */
  struct mbuf *m = lpc24xx_eth_new_mbuf(ifp, wait);

  /* Check mbuf */
  if (m != NULL) {
    /* Add mbuf to queue */
    desc [i].start = mtod(m, uint32_t);
    desc [i].control = SET_ETH_RX_CTRL_SIZE(0, MCLBYTES - 1)
      | ETH_RX_CTRL_INTERRUPT;

    /* Add mbuf to table */
    mbuf_table [i] = m;

    return true;
  } else {
    return false;
  }
}

static void lpc24xx_eth_receive_task(void *arg)
{
  rtems_status_code sc = RTEMS_SUCCESSFUL;
  rtems_event_set events = 0;
  lpc24xx_eth_driver_entry *e = (lpc24xx_eth_driver_entry *) arg;
  struct ifnet *ifp = &e->arpcom.ac_if;
  volatile lpc24xx_eth_transfer_descriptor *const desc =
    (volatile lpc24xx_eth_transfer_descriptor *)
      LPC24XX_ETH_RECEIVE_DESC_START;
  volatile lpc24xx_eth_receive_info *const info = 
    (volatile lpc24xx_eth_receive_info *)
      LPC24XX_ETH_RECEIVE_INFO_START;
  struct mbuf **const mbuf_table =
    (struct mbuf **) LPC24XX_ETH_RECEIVE_MBUF_START;
  uint32_t index_max = 0;
  uint32_t produce_index = 0;
  uint32_t consume_index = 0;
  uint32_t receive_index = 0;

  LPC24XX_ETH_PRINTF("%s\n", __func__);

  /* Main event loop */
  while (true) {
    bool wait_for_mbuf = false;

    /* Wait for events */
    sc = rtems_bsdnet_event_receive(
      LPC24XX_ETH_EVENT_INITIALIZE | LPC24XX_ETH_EVENT_INTERRUPT, 
      RTEMS_EVENT_ANY | RTEMS_WAIT,
      RTEMS_NO_TIMEOUT,
      &events
    );
    RTEMS_CLEANUP_SC(sc, cleanup, "wait for events");

    LPC24XX_ETH_PRINTF("rx: wake up: 0x%08" PRIx32 "\n", events);

    /* Initialize receiver? */
    if (IS_FLAG_SET(events, LPC24XX_ETH_EVENT_INITIALIZE)) {
      /* Disable receive interrupts */
      lpc24xx_eth_disable_receive_interrupts();

      /* Disable receiver */
      MAC_COMMAND = CLEAR_FLAG(MAC_COMMAND, ETH_CMD_RX_ENABLE);

      /* Wait for inactive status */
      while (IS_FLAG_SET(MAC_STATUS, ETH_STAT_RX_ACTIVE)) {
        /* Wait */
      }

      /* Reset */
      MAC_COMMAND = SET_FLAG(MAC_COMMAND, ETH_CMD_RX_RESET);

      /* Clear receive interrupts */
      MAC_INTCLEAR = LPC24XX_ETH_INTERRUPT_RECEIVE;

      /* Index maximum (determines queue size) */
      index_max = e->receive_unit_number - 1;

      /* Move existing mbufs to the front */
      consume_index = 0;
      for (produce_index = 0; produce_index <= index_max; ++produce_index) {
        if (mbuf_table [produce_index] != NULL) {
          mbuf_table [consume_index] = mbuf_table [produce_index];
          ++consume_index;
        }
      }

      /* Fill receive queue */
      for (produce_index = consume_index; produce_index <= index_max; ++produce_index) {
        if (
          !lpc24xx_eth_add_new_mbuf(ifp, desc, mbuf_table, produce_index, false)
        ) {
          break;
        }
      }

      /* Check if the queue is full */
      if (produce_index == 0) {
        RTEMS_DO_CLEANUP(
          cleanup,
          "no mbufs to fill receive queue: terminate receive task\n"
        );
      } else if (produce_index <= index_max) {
        /* Reduce the queue size */
        index_max = produce_index - 1;

        RTEMS_SYSLOG_ERROR("not enough mbufs to fill receive queue");
      }

      /* Receive descriptor table */
      MAC_RXDESCRIPTORNUM = index_max;
      MAC_RXDESCRIPTOR = (uint32_t) desc;
      MAC_RXSTATUS = (uint32_t) info;

