RTEMS/rtems/c/src/lib/libbsp/arm/lpc24xx/network/network.c
      /* Initialize indices */
      produce_index = MAC_RXPRODUCEINDEX;
      consume_index = MAC_RXCONSUMEINDEX;
      receive_index = consume_index;

      /* Enable receiver */
      MAC_COMMAND = SET_FLAG(MAC_COMMAND, ETH_CMD_RX_ENABLE);

      /* Enable receive interrupts */
      lpc24xx_eth_enable_receive_interrupts();

      /* Wait for events */
      continue;
    }

    while (true) {
      /* Clear receive interrupt status */
      MAC_INTCLEAR = LPC24XX_ETH_INTERRUPT_RECEIVE;

      /* Get current produce index */
      produce_index = MAC_RXPRODUCEINDEX;

      if (receive_index != produce_index) {
        /* Fragment mbuf and status */
        struct mbuf *m = mbuf_table [receive_index];
        uint32_t stat = info [receive_index].status;

        /* Remove mbuf from table */
        mbuf_table [receive_index] = NULL;

        if (
          IS_FLAG_SET(stat, ETH_RX_STAT_LAST_FLAG)
            && ARE_FLAGS_CLEARED(stat, LPC24XX_ETH_RX_STAT_ERRORS)
        ) {
          /* Ethernet header */
          struct ether_header *eh = mtod(m, struct ether_header *);

          /* Discard Ethernet header and CRC */
          int sz = (int) GET_ETH_RX_STAT_RXSIZE(stat) + 1
            - ETHER_HDR_LEN - ETHER_CRC_LEN;

          /* Update mbuf */
          m->m_len = sz;
          m->m_pkthdr.len = sz;
          m->m_data = mtod(m, char *) + ETHER_HDR_LEN;

          LPC24XX_ETH_PRINTF("rx: %02" PRIu32 ": %u\n", receive_index, sz);

          /* Hand over */
          ether_input(ifp, eh, m);

          /* Increment received frames counter */
          ++e->received_frames;
        } else {
          /* Release mbuf */
          m_free(m);

          /* Update error counters */
          if (IS_FLAG_SET(stat, ETH_RX_STAT_OVERRUN)) {
            ++e->receive_overrun_errors;
          }
          if (IS_FLAG_CLEARED(stat, ETH_RX_STAT_LAST_FLAG)) {
            ++e->receive_fragment_errors;
          }
          if (IS_FLAG_SET(stat, ETH_RX_STAT_CRC_ERROR)) {
            ++e->receive_crc_errors;
          }
          if (IS_FLAG_SET(stat, ETH_RX_STAT_SYMBOL_ERROR)) {
            ++e->receive_symbol_errors;
          }
          if (IS_FLAG_SET(stat, ETH_RX_STAT_LENGTH_ERROR)) {
            ++e->receive_length_errors;
          }
          if (IS_FLAG_SET(stat, ETH_RX_STAT_ALIGNMENT_ERROR)) {
            ++e->receive_alignment_errors;
          }
          if (IS_FLAG_SET(stat, ETH_RX_STAT_NO_DESCRIPTOR)) {
            ++e->receive_no_descriptor_errors;
          }
        }

        /* Increment receive index */
        receive_index = lpc24xx_eth_increment(receive_index, index_max);
      } else {
        /* Nothing to do, enable receive interrupts */
        lpc24xx_eth_enable_receive_interrupts();
        break;
      }
    }

    /* Wait for mbuf? */
    wait_for_mbuf =
      lpc24xx_eth_increment(produce_index, index_max) == consume_index;

    /* Fill queue with new mbufs */
    while (consume_index != produce_index) {
      /* Add new mbuf to queue */
      if (
        !lpc24xx_eth_add_new_mbuf(
          ifp, desc, mbuf_table, consume_index, wait_for_mbuf
        )
      ) {
        break;
      }

      /* We wait for at most one mbuf */
      wait_for_mbuf = false;

      /* Increment consume index */
      consume_index = lpc24xx_eth_increment(consume_index, index_max);

      /* Update consume indices */
      MAC_RXCONSUMEINDEX = consume_index;
    }
  }

cleanup:

  /* Clear task ID */
  e->receive_task = RTEMS_ID_NONE;

  /* Release network semaphore */
  rtems_bsdnet_semaphore_release();

  /* Terminate self */
  (void) rtems_task_delete(RTEMS_SELF);
}

static struct mbuf *lpc24xx_eth_next_fragment(
  struct ifnet *ifp,
  struct mbuf *m,
  uint32_t *ctrl
)
{
  struct mbuf *n = NULL;
  int size = 0;

  while (true) {
    if (m == NULL) {
      /* Dequeue first fragment of the next frame */
      IF_DEQUEUE(&ifp->if_snd, m);

      /* Empty queue? */
      if (m == NULL) {
        return m;
      }
    }

    /* Get fragment size */
    size = m->m_len;

    if (size > 0) {
      /* Now we have a not empty fragment */
      break;
    } else {
      /* Discard empty fragments */
      m = m_free(m);
    }
  }

  /* Set fragment size */
  *ctrl = SET_ETH_TX_CTRL_SIZE(0, size - 1);

  /* Discard empty successive fragments */
  n = m->m_next;
  while (n != NULL && n->m_len <= 0) {
    n = m_free(n);
  }
  m->m_next = n;

  /* Is our fragment the last in the frame? */
  if (n == NULL) {
    *ctrl = SET_FLAGS(*ctrl, LPC24XX_ETH_LAST_FRAGMENT_FLAGS);
  }

  return m;
}

static void lpc24xx_eth_transmit_task(void *arg)
{
  rtems_status_code sc = RTEMS_SUCCESSFUL;
  rtems_event_set events = 0;
  lpc24xx_eth_driver_entry *e = (lpc24xx_eth_driver_entry *) arg;
  struct ifnet *ifp = &e->arpcom.ac_if;
  volatile lpc24xx_eth_transfer_descriptor *const desc =
    (volatile lpc24xx_eth_transfer_descriptor *)
      LPC24XX_ETH_TRANSMIT_DESC_START;
  volatile uint32_t *const status =
    (volatile uint32_t *) LPC24XX_ETH_TRANSMIT_STATUS_START;
  volatile char *const buf =
    (volatile char *) LPC24XX_ETH_TRANSMIT_BUFFER_START;
  struct mbuf *m = NULL;
  uint32_t index_max = e->transmit_unit_number - 1;
  uint32_t produce_index = 0;
  uint32_t consume_index = 0;
  uint32_t ctrl = 0;
  uint32_t frame_length = 0;
  char *frame_buffer = NULL;

  LPC24XX_ETH_PRINTF("%s\n", __func__);

  /* Initialize descriptor table */
  for (produce_index = 0; produce_index <= index_max; ++produce_index) {
    desc [produce_index].start =
      (uint32_t) (buf + produce_index * LPC24XX_ETH_TRANSMIT_BUFFER_SIZE);
  }

  /* Main event loop */
  while (true) {
    /* Wait for events */
    sc = rtems_bsdnet_event_receive(
      LPC24XX_ETH_EVENT_INITIALIZE
        | LPC24XX_ETH_EVENT_START 
        | LPC24XX_ETH_EVENT_INTERRUPT,
      RTEMS_EVENT_ANY | RTEMS_WAIT,
      RTEMS_NO_TIMEOUT,
      &events
    );
    RTEMS_CLEANUP_SC(sc, cleanup, "wait for events");

    LPC24XX_ETH_PRINTF("tx: wake up: 0x%08" PRIx32 "\n", events);

    /* Initialize transmitter? */
    if (IS_FLAG_SET(events, LPC24XX_ETH_EVENT_INITIALIZE)) {
      /* Disable transmit interrupts */
      lpc24xx_eth_disable_transmit_interrupts();

