RTEMS/rtems/c/src/lib/libbsp/arm/lpc24xx/network/network.c
      /* Disable transmitter */
      MAC_COMMAND = CLEAR_FLAG(MAC_COMMAND, ETH_CMD_TX_ENABLE);

      /* Wait for inactive status */
      while (IS_FLAG_SET(MAC_STATUS, ETH_STAT_TX_ACTIVE)) {
        /* Wait */
      }

      /* Reset */
      MAC_COMMAND = SET_FLAG(MAC_COMMAND, ETH_CMD_TX_RESET);

      /* Clear transmit interrupts */
      MAC_INTCLEAR = LPC24XX_ETH_INTERRUPT_TRANSMIT;

      /* Transmit descriptors */
      MAC_TXDESCRIPTORNUM = index_max;
      MAC_TXDESCRIPTOR = (uint32_t) desc;
      MAC_TXSTATUS = (uint32_t) status;

      /* Initialize indices */
      produce_index = MAC_TXPRODUCEINDEX;
      consume_index = MAC_TXCONSUMEINDEX;

      /* Frame buffer start */
      frame_buffer = (char *) desc [produce_index].start;

      /* Enable transmitter */
      MAC_COMMAND = SET_FLAG(MAC_COMMAND, ETH_CMD_TX_ENABLE);
    }

    /* Free consumed fragments */
    while (true) {
      /* Save last known consume index */
      uint32_t c = consume_index;

      /* Clear transmit interrupt status */
      MAC_INTCLEAR = LPC24XX_ETH_INTERRUPT_TRANSMIT;

      /* Get new consume index */
      consume_index = MAC_TXCONSUMEINDEX;

      /* Nothing consumed in the meantime? */
      if (c == consume_index) {
        break;
      }

      while (c != consume_index) {
        uint32_t s = status [c];

        /* Update error counters */
        if (
          IS_ANY_FLAG_SET(s, ETH_TX_STAT_ERROR | ETH_TX_STAT_NO_DESCRIPTOR)
        ) {
          if (IS_FLAG_SET(s, ETH_TX_STAT_UNDERRUN)) {
            ++e->transmit_underrun_errors;
          }
          if (IS_FLAG_SET(s, ETH_TX_STAT_LATE_COLLISION)) {
            ++e->transmit_late_collision_errors;
          }
          if (IS_FLAG_SET(s, ETH_TX_STAT_EXCESSIVE_COLLISION)) {
            ++e->transmit_excessive_collision_errors;
          }
          if (IS_FLAG_SET(s, ETH_TX_STAT_EXCESSIVE_DEFER)) {
            ++e->transmit_excessive_defer_errors;
          }
          if (IS_FLAG_SET(s, ETH_TX_STAT_NO_DESCRIPTOR)) {
            ++e->transmit_no_descriptor_errors;
          }
        }

        /* Next consume index */
        c = lpc24xx_eth_increment(c, index_max);
      }
    }

    /* Transmit new fragments */
    while (true) {
      /* Compute next produce index */
      uint32_t p = lpc24xx_eth_increment(produce_index, index_max);

      /* Queue full? */
      if (p == consume_index) {
        /* The queue is full, wait for transmit interrupt */
        break;
      }

      /* Get next fragment and control value */
      m = lpc24xx_eth_next_fragment(ifp, m, &ctrl);

      /* New fragment? */
      if (m != NULL) {
        size_t fragment_length = (size_t) m->m_len;
        void *fragment_start = mtod(m, void *);
        uint32_t new_frame_length = frame_length + fragment_length;

        /* Check buffer size */
        if (new_frame_length > LPC24XX_ETH_TRANSMIT_BUFFER_SIZE) {
          LPC24XX_ETH_PRINTF("tx: overflow\n");

          /* Discard overflow data */
          new_frame_length = LPC24XX_ETH_TRANSMIT_BUFFER_SIZE;
          fragment_length = new_frame_length - frame_length;

          /* Finalize frame */
          ctrl = SET_FLAGS(ctrl, LPC24XX_ETH_LAST_FRAGMENT_FLAGS);

          /* Update error counter */
          ++e->transmit_overflow_errors;
        }

        LPC24XX_ETH_PRINTF(
          "tx: copy: %" PRIu32 "%s%s\n",
          fragment_length,
          IS_FLAG_SET(m->m_flags, M_EXT) ? ", E" : "",
          IS_FLAG_SET(m->m_flags, M_PKTHDR) ? ", H" : ""
        );

        /* Copy fragment to buffer in Ethernet RAM */
        memcpy(frame_buffer, fragment_start, fragment_length);

        if (IS_FLAG_SET(ctrl, ETH_TX_CTRL_LAST)) {
          /* Finalize descriptor */
          desc [produce_index].control =
            SET_ETH_TX_CTRL_SIZE(ctrl, new_frame_length - 1);

          LPC24XX_ETH_PRINTF("tx: %02" PRIu32 ": %" PRIu32 "\n", produce_index, new_frame_length);

          /* Next produce index */
          produce_index = p;

          /* Update the produce index */
          MAC_TXPRODUCEINDEX = produce_index;

          /* Reinitialize frame length and buffer start */
          frame_length = 0;
          frame_buffer = (char *) desc [produce_index].start;

          /* Increment transmitted frames counter */
          ++e->transmitted_frames;
        } else {
          /* New frame length */
          frame_length = new_frame_length;

          /* Update current frame buffer start */
          frame_buffer += fragment_length;
        }

        /* Free mbuf and get next */
        m = m_free(m);
      } else {
        /* Nothing to transmit */
        break;
      }
    }

    /* No more fragments? */
    if (m == NULL) {
      /* Interface is now inactive */
      ifp->if_flags = CLEAR_FLAG(ifp->if_flags, IFF_OACTIVE);
    } else {
      /* Enable transmit interrupts */
      lpc24xx_eth_enable_transmit_interrupts();
    }
  }

cleanup:

  /* Clear task ID */
  e->transmit_task = RTEMS_ID_NONE;

  /* Release network semaphore */
  rtems_bsdnet_semaphore_release();

  /* Terminate self */
  (void) rtems_task_delete(RTEMS_SELF);
}

static void lpc24xx_eth_interface_init(void *arg)
{
  rtems_status_code sc = RTEMS_SUCCESSFUL;
  lpc24xx_eth_driver_entry *e = (lpc24xx_eth_driver_entry *) arg;
  struct ifnet *ifp = &e->arpcom.ac_if;

  LPC24XX_ETH_PRINTF("%s\n", __func__);

  if (e->state == LPC24XX_ETH_INITIALIZED) {
    /* Enable module power */
    lpc24xx_module_enable(
      LPC24XX_MODULE_ETHERNET,
      0,
      LPC24XX_MODULE_PCLK_DEFAULT
    );

    /* Module IO configuration */
    #ifdef LPC24XX_ETHERNET_RMII
    	lpc24xx_io_config(LPC24XX_MODULE_ETHERNET, 0, 0);
    #else
    	lpc24xx_io_config(LPC24XX_MODULE_ETHERNET, 0, 1);
    #endif

    /* Soft reset */

    /* Do soft reset */
    MAC_COMMAND = 0x38;
    MAC_MAC1 = 0xcf00;

    /* Initialize PHY */
    /* TODO */

    /* Reinitialize registers */
    MAC_MAC2 = 0x31;
    MAC_IPGT = 0x15;
    MAC_IPGR = 0x12;
    MAC_CLRT = 0x370f;
    MAC_MAXF = 0x0600;
    MAC_SUPP = 0x0100;
    MAC_TEST = 0;
    #ifdef LPC24XX_ETHERNET_RMII
      MAC_COMMAND = 0x0400;
    #else
      MAC_COMMAND = 0x0600;
    #endif
    MAC_INTENABLE = 0;
    MAC_INTCLEAR = 0x30ff;
    MAC_POWERDOWN = 0;

    /* MAC address */
    MAC_SA0 = ((uint32_t) e->arpcom.ac_enaddr [5] << 8)
      | (uint32_t) e->arpcom.ac_enaddr [4];
    MAC_SA1 = ((uint32_t) e->arpcom.ac_enaddr [3] << 8)
      | (uint32_t) e->arpcom.ac_enaddr [2];
    MAC_SA2 = ((uint32_t) e->arpcom.ac_enaddr [1] << 8)
      | (uint32_t) e->arpcom.ac_enaddr [0];

    /* Enable receiver */
    MAC_MAC1 = 0x03;

    /* Start receive task */
    if (e->receive_task == RTEMS_ID_NONE) {
      e->receive_task = rtems_bsdnet_newproc(
        "ntrx", 
        4096, 
        lpc24xx_eth_receive_task,
        e
      );
      sc = rtems_event_send(e->receive_task, LPC24XX_ETH_EVENT_INITIALIZE);
      RTEMS_SYSLOG_ERROR_SC(sc, "send receive initialize event");
    }

