RTEMS/rtems/c/src/lib/libbsp/arm/lpc24xx/network/network.c
    /* Start transmit task */
    if (e->transmit_task == RTEMS_ID_NONE) {
      e->transmit_task = rtems_bsdnet_newproc(
        "nttx", 
        4096, 
        lpc24xx_eth_transmit_task,
        e
      );
      sc = rtems_event_send(e->transmit_task, LPC24XX_ETH_EVENT_INITIALIZE);
      RTEMS_SYSLOG_ERROR_SC(sc, "send transmit initialize event");
    }

    /* Change state */
    if (
      e->receive_task != RTEMS_ID_NONE && e->transmit_task != RTEMS_ID_NONE
    ) {
      e->state = LPC24XX_ETH_STARTED;
    }
  }

  if (e->state == LPC24XX_ETH_STARTED) {
    /* Enable fatal interrupts */
    MAC_INTENABLE = ETH_INT_RX_OVERRUN | ETH_INT_TX_UNDERRUN;

    /* Enable promiscous mode */
    lpc24xx_eth_enable_promiscous_mode(
      IS_FLAG_SET(ifp->if_flags, IFF_PROMISC)
    );

    /* Start watchdog timer */
    ifp->if_timer = 1;

    /* Set interface to running state */
    ifp->if_flags = SET_FLAG(ifp->if_flags, IFF_RUNNING);

    /* Change state */
    e->state = LPC24XX_ETH_RUNNING;
  }
}

static void lpc24xx_eth_interface_stats(const lpc24xx_eth_driver_entry *e)
{
  rtems_bsdnet_semaphore_release();

  printf("received frames:                     %u\n", e->received_frames);
  printf("receive interrupts:                  %u\n", e->receive_interrupts);
  printf("transmitted frames:                  %u\n", e->transmitted_frames);
  printf("transmit interrupts:                 %u\n", e->transmit_interrupts);
  printf("receive overrun errors:              %u\n", e->receive_overrun_errors);
  printf("receive fragment errors:             %u\n", e->receive_fragment_errors);
  printf("receive CRC errors:                  %u\n", e->receive_crc_errors);
  printf("receive symbol errors:               %u\n", e->receive_symbol_errors);
  printf("receive length errors:               %u\n", e->receive_length_errors);
  printf("receive alignment errors:            %u\n", e->receive_alignment_errors);
  printf("receive no descriptor errors:        %u\n", e->receive_no_descriptor_errors);
  printf("receive fatal errors:                %u\n", e->receive_fatal_errors);
  printf("transmit underrun errors:            %u\n", e->transmit_underrun_errors);
  printf("transmit late collision errors:      %u\n", e->transmit_late_collision_errors);
  printf("transmit excessive collision errors: %u\n", e->transmit_excessive_collision_errors);
  printf("transmit excessive defer errors:     %u\n", e->transmit_excessive_defer_errors);
  printf("transmit no descriptor errors:       %u\n", e->transmit_no_descriptor_errors);
  printf("transmit overflow errors:            %u\n", e->transmit_overflow_errors);
  printf("transmit fatal errors:               %u\n", e->transmit_fatal_errors);

  rtems_bsdnet_semaphore_obtain();
}

static int lpc24xx_eth_interface_ioctl(
  struct ifnet *ifp,
  ioctl_command_t command,
  caddr_t data
)
{
  lpc24xx_eth_driver_entry *e = (lpc24xx_eth_driver_entry *) ifp->if_softc;
  int rv = 0;

  LPC24XX_ETH_PRINTF("%s\n", __func__);

  switch (command)  {
    case SIOCGIFMEDIA:
    case SIOCSIFMEDIA:
      rtems_mii_ioctl(&e->mdio_info, e, (int) command, (int *) data);
      break;
    case SIOCGIFADDR:
    case SIOCSIFADDR:
      ether_ioctl(ifp, command, data);
      break;
    case SIOCSIFFLAGS:
      if (ifp->if_flags & IFF_RUNNING) {
        /* TODO: off */
      }
      if (ifp->if_flags & IFF_UP) {
        ifp->if_flags = SET_FLAG(ifp->if_flags, IFF_RUNNING);
        /* TODO: init */
      }
      break;
    case SIO_RTEMS_SHOW_STATS:
      lpc24xx_eth_interface_stats(e);
      break;
    default:
      rv = EINVAL;
      break;
  }

  return rv;
}

static void lpc24xx_eth_interface_start(struct ifnet *ifp)
{
  rtems_status_code sc = RTEMS_SUCCESSFUL;
  lpc24xx_eth_driver_entry *e = (lpc24xx_eth_driver_entry *) ifp->if_softc;

  ifp->if_flags = SET_FLAG(ifp->if_flags, IFF_OACTIVE);

  sc = rtems_event_send(e->transmit_task, LPC24XX_ETH_EVENT_START);
  RTEMS_SYSLOG_ERROR_SC(sc, "send transmit start event");
}

static void lpc24xx_eth_interface_watchdog(struct ifnet *ifp)
{
  LPC24XX_ETH_PRINTF("%s\n", __func__);
}

static int lpc24xx_eth_attach(struct rtems_bsdnet_ifconfig *config)
{
  rtems_status_code sc = RTEMS_SUCCESSFUL;
  lpc24xx_eth_driver_entry *e = &lpc24xx_eth_driver_data;
  struct ifnet *ifp = &e->arpcom.ac_if;
  char *unit_name = NULL;
  int unit_number = rtems_bsdnet_parse_driver_name(config, &unit_name);

  /* Check parameter */
  if (unit_number < 0) {
    RTEMS_SYSLOG_ERROR("parse error for interface name\n");
    return 0;
  }
  if (unit_number != 0) {
    RTEMS_DO_CLEANUP(cleanup, "unexpected unit number");
  }
  if (config->hardware_address == NULL) {
    RTEMS_DO_CLEANUP(cleanup, "MAC address missing");
  }
  if (e->state != LPC24XX_ETH_NOT_INITIALIZED) {
    RTEMS_DO_CLEANUP(cleanup, "already attached");
  }

  /* Interrupt number */
  config->irno = LPC24XX_IRQ_ETHERNET;

  /* Device control */
  config->drv_ctrl = e;

  /* Receive unit number */
  if (
    config->rbuf_count <= 0
      || config->rbuf_count > LPC24XX_ETH_RECEIVE_UNIT_NUMBER
  ) {
    config->rbuf_count = LPC24XX_ETH_RECEIVE_UNIT_NUMBER;
  }
  e->receive_unit_number = (unsigned) config->rbuf_count;

  /* Transmit unit number */
  if (
    config->xbuf_count <= 0
      || config->xbuf_count > LPC24XX_ETH_TRANSMIT_UNIT_NUMBER
  ) {
    config->xbuf_count = LPC24XX_ETH_TRANSMIT_UNIT_NUMBER;
  }
  e->transmit_unit_number = (unsigned) config->xbuf_count;

  /* Disable interrupts */
  MAC_INTENABLE = 0;

  /* Install interrupt handler */
  sc = rtems_interrupt_handler_install(
    config->irno,
    "Ethernet",
    RTEMS_INTERRUPT_UNIQUE,
    lpc24xx_eth_interrupt_handler,
    e
  );
  RTEMS_CLEANUP_SC(sc, cleanup, "install interrupt handler");

  /* Copy MAC address */
  memcpy(e->arpcom.ac_enaddr, config->hardware_address, ETHER_ADDR_LEN);

  /* Clear Ethernet RAM */
  memset((void *) LPC24XX_ETH_RAM_START, 0, (size_t) LPC24XX_ETH_RAM_SIZE);

  /* Set interface data */
  ifp->if_softc = e;
  ifp->if_unit = (short) unit_number;
  ifp->if_name = unit_name;
  ifp->if_mtu = (config->mtu > 0) ? (u_long) config->mtu : ETHERMTU;
  ifp->if_init = lpc24xx_eth_interface_init;
  ifp->if_ioctl = lpc24xx_eth_interface_ioctl;
  ifp->if_start = lpc24xx_eth_interface_start;
  ifp->if_output = ether_output;
  ifp->if_watchdog = lpc24xx_eth_interface_watchdog;
  ifp->if_flags = config->ignore_broadcast ? 0 : IFF_BROADCAST;
  ifp->if_snd.ifq_maxlen = ifqmaxlen;
  ifp->if_timer = 0;

  /* Change status */
  e->state = LPC24XX_ETH_INITIALIZED;

  /* Attach the interface */
  if_attach(ifp);
  ether_ifattach(ifp);

  return 1;

cleanup:

  /* FIXME: Type */
  free(unit_name, (int) 0xdeadbeef);

  return 0;
}

static int lpc24xx_eth_detach(struct rtems_bsdnet_ifconfig *config)
{
  /* FIXME: Detach the interface from the upper layers? */

  /* Module soft reset */
  MAC_COMMAND = 0x38;
  MAC_MAC1 = 0xcf00;

  /* FIXME: More cleanup */

  return 0;
}

int lpc24xx_eth_attach_detach(
  struct rtems_bsdnet_ifconfig *config,
  int attaching
)
{
  /* FIXME: Return value */

  if (attaching) {
    return lpc24xx_eth_attach(config);
  } else {
    return lpc24xx_eth_detach(config);
  }
}
